/**************************************************************************************
*		              LED闪烁的简单试验												  *
*                延时实现p1口LED流水灯效果 （用循环移位指令） 			              *
*																					  *
*																					  *
***************************************************************************************/
#include <reg51.h>	    //此文件中定义了51的一些特殊功能寄存器

// 延时子程序
void delayms(unsigned char ms)	
{						
	unsigned char i;
	while(ms--)
	{
		for(i = 0; i < 120; i++);
	}
}


main()
{
	unsigned char LED;
	LED = 0xfe;	  //0xfe = 1111 1110
 	while(1)
	{
	      
    	 P1 = LED;
		 delayms(250);
		 LED = LED << 1;    //循环左移1位，点亮下一个LED "<<"为左移位
		 if(LED == 0x00 )	 
		 { P1 = LED; LED = 0xfe;  delayms(250);  } // 0xfe = 1111 1110
	}
}






